#!/bin/bash

echo ""
echo -e "\e[34m ██████╗  █████╗ ██████╗ ███╗   ███╗ █████╗ ███╗   ██╗ █████╗     ██████╗   \e[0m"
echo -e "\e[34m ██╔══██╗██╔══██╗██╔══██╗████╗ ████║██╔══██╗████╗  ██║██╔══██╗    ╚════██╗   \e[0m"
echo -e "\e[34m ██████╔╝███████║██████╔╝██╔████╔██║███████║██╔██╗ ██║███████║     █████╔╝  \e[0m"
echo -e "\e[34m ██╔═══╝ ██╔══██║██╔══██╗██║╚██╔╝██║██╔══██║██║╚██╗██║██╔══██║    ██╔═══╝    \e[0m"
echo -e "\e[34m ██║     ██║  ██║██║  ██║██║ ╚═╝ ██║██║  ██║██║ ╚████║██║  ██║    ███████╗   \e[0m"
echo -e "\e[34m ╚═╝     ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝    ╚══════╝    \e[0m"
echo ""
echo "Bootstrapping Parmana 2.0 Installer..."

# Create virtual environment
python3 -m venv .venv

# Activate it and run interactive setup
source .venv/bin/activate
python3 setup.py
